tests/k6-test/k6_latest_result.txt
BunBo Microservices — Load Test Results (300 VUs)
Date: 2026-06-14

  █ THRESHOLDS                                                              
                                                                     
    checks{flow:chaosFlow}                                           
    ✓ 'rate>0.90' rate=95.17%                                        
                                                                     
    checks{flow:voucherRaceFlow}                                     
    ✓ 'rate>0.95' rate=97.26%

    http_req_duration
    ✗ 'p(95)<2000' p(95)=7.8s

      {flow:guestFlow}
      ✗ 'p(95)<1500' p(95)=7.31s

      {flow:kitchenAdminFlow}
      ✗ 'p(95)<1000' p(95)=8.22s

      {flow:memberFlow}
      ✗ 'p(95)<2000' p(95)=8.74s

      {flow:voucherRaceFlow}
      ✗ 'p(95)<800' p(95)=15s

    http_req_failed
    ✗ 'rate<0.05' rate=17.75%


  █ TOTAL RESULTS 

    checks_total.......: 41517  53.39048/s
    checks_succeeded...: 98.08% 40724 out of 41517
    checks_failed......: 1.91%  793 out of 41517

    ✗ guest: scan 200
      ↳  98% — ✓ 6263 / ✗ 83
    ✗ guest: cart 200
      ↳  98% — ✓ 6194 / ✗ 69
    ✗ race: valid response
      ↳  94% — ✓ 2487 / ✗ 144
    ✓ race: no server error
    ✗ member: scan 200
      ↳  98% — ✓ 1524 / ✗ 20
    ✗ guest: order 201
      ↳  98% — ✓ 6105 / ✗ 89
    ✗ member: cart 200
      ↳  99% — ✓ 1510 / ✗ 14
    ✗ member: vouchers 200
      ↳  97% — ✓ 1468 / ✗ 42
    ✗ member: order 201
      ↳  98% — ✓ 1493 / ✗ 17
    ✗ member: payment init 200
      ↳  98% — ✓ 1475 / ✗ 18
    ✗ member: webhook 200
      ↳  97% — ✓ 1444 / ✗ 31
    ✗ member: points 200
      ↳  97% — ✓ 1445 / ✗ 30
    ✗ chaos: duplicate webhook handled
      ↳  88% — ✓ 797 / ✗ 103
    ✗ chaos: malformed json → 400
      ↳  91% — ✓ 819 / ✗ 81
    ✓ chaos: 404 caught
    ✗ chaos: empty cart order → 400/404
      ↳  99% — ✓ 893 / ✗ 7
    ✗ chaos: invalid voucher auth → 401
      ↳  97% — ✓ 874 / ✗ 26
    ✗ kitchen: unread 200
      ↳  98% — ✓ 483 / ✗ 6
    ✗ kitchen: complete 204
      ↳  99% — ✓ 960 / ✗ 6
    ✗ kitchen: cash paid 204
      ↳  99% — ✓ 959 / ✗ 7

    CUSTOM
    orders_created_total...........: 7598   9.770958/s
    orders_paid_total..............: 959    1.233265/s
    voucher_race_rejected..........: 2487   3.198259/s

    HTTP
    http_req_duration..............: avg=1.26s min=44.73ms  med=144.27ms max=15s   p(90)=4.9s  p(95)=7.8s  
      { expected_response:true }...: avg=1.1s  min=44.73ms  med=145.21ms max=15s   p(90)=4.19s p(95)=7.06s 
      { flow:guestFlow }...........: avg=1.1s  min=44.73ms  med=114.87ms max=15s   p(90)=4.02s p(95)=7.31s 
      { flow:kitchenAdminFlow }....: avg=1.43s min=61.93ms  med=178.74ms max=15s   p(90)=6.15s p(95)=8.22s 
      { flow:memberFlow }..........: avg=1.55s min=50.37ms  med=208.63ms max=15s   p(90)=6.23s p(95)=8.74s 
      { flow:voucherRaceFlow }.....: avg=2.08s min=51.17ms  med=170.41ms max=15s   p(90)=8.53s p(95)=15s   
    http_req_failed................: 17.75% 8541 out of 48115
    http_reqs......................: 48115  61.875447/s

    EXECUTION
    iteration_duration.............: avg=9.55s min=551.63ms med=6.42s    max=1m11s p(90)=20.4s p(95)=26.73s
    iterations.....................: 11910  15.31615/s
    vus............................: 1      min=0             max=300
    vus_max........................: 300    min=300           max=300

    NETWORK
    data_received..................: 30 MB  39 kB/s
    data_sent......................: 8.0 MB 10 kB/s

running (12m57.6s), 000/300 VUs, 11910 complete and 0 interrupted iterations
chaos_flow   ✓ [==================================] 00/15 VUs    9m0s       
guest_flow   ✓ [==================================] 000/150 VUs  9m0s
member_flow  ✓ [==================================] 00/90 VUs    9m0s
voucher_race ✓ [==================================] 00/25 VUs    6m0s
kitchen_flow ✓ [==================================] 00/20 VUs    8m0s
ERRO[0778] thresholds on metrics 'http_req_duration, http_req_duration{flow:guestFlow}, http_req_duration{flow:kitchenAdminFlow}, http_req_duration{flow:memberFlow}, http_req_duration{flow:voucherRaceFlow}, http_req_failed' have been crossed